
## Plan Result (aat)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-aat"
      + api_type              = "http"
      + display_name          = "Payments API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "payments-api"
      + path                  = "payments-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://payment-api-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/ccpay-payment-app.recon-payments-v0.3.json"
        }
    }

  # module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-aat"
      + api_name            = "payments-api"
      + id                  = (known after apply)
      + product_id          = "payments"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-aat"
      + api_name            = "payments-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {"B1BF8007527F85085D7C4A3DC406A9A6D124D721","13D1848E8B050CE55E4D41A35A60FF4A17E686A6","B1C45E55A1E93AD43A473972CFF490722EEF1E38","B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4","B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE","9AF616DC3860C9736BBD20ADAD34AAFD913FD6CA","B49BDDE7818B78058AC7401BE0284A40845031E3","E5F54E7BA2B780E2B1B1FFAC68F801251935BE80","C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3","7744A2F56BD3B73C0D7FED61309E1C65AF08538C"}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="403" reason="Invalid client certificate. Please check expiry."/>
                            </return-response>
                        </when>
                    </choose>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="api_gw" />
                    <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "C5OI566EGMPHT3CC".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] & 0xf;
                            int truncatedHash = hash[offset] & 0x7f;
                            for (int i = 1; i < 4; i++)
                            {
                                truncatedHash <<= 8;
                                truncatedHash |= hash[offset + i] & 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString("D6");
                        }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Response.StatusCode == 200 || context.Response.StatusCode == 206)">
                            <find-and-replace from="giro_slip_no" to="bank_giro_credit_slip_number" />
                            <find-and-replace from="volume" to="volume_amount" />
                            <find-and-replace from="&quot;reference&quot;" to="&quot;fee_reference&quot;" />
                        </when>
                    </choose>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-aat"
      + approval_required     = true
      + display_name          = "payments"
      + id                    = (known after apply)
      + product_id            = "payments"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":122,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->